[
  {
    "errorcode": "400",
    "errorTitle": "Hatalı istek - Bad request",
    "errordesc": "The server cannot or will not process the request due to something that is perceived to be a client error (e.g., malformed request syntax, invalid request message framing, or deceptive request routing)."
  },
  {
    "errorcode": "401",
    "errorTitle": "Yetkisiz - Unauthorized",
    "errordesc": "Although the HTTP standard specifies 'unauthorized', semantically this response means 'unauthenticated'. That is, the client must authenticate itself to get the requested response."
  },
  {
    "errorcode": "403",
    "errorTitle": "Forbidden",
    "errordesc": "The client does not have access rights to the content; that is, it is unauthorized, so the server is refusing to give the requested resource. Unlike 401 Unauthorized, the client's identity is known to the server."
  },
  {
    "errorcode": "404",
    "errorTitle": "Not Found",
    "errordesc": "The server cannot find the requested resource. In the browser, this means the URL is not recognized. In an API, this can also mean that the endpoint is valid but the resource itself does not exist. Servers may also send this response instead of 403 Forbidden to hide the existence of a resource from an unauthorized client. This response code is probably the most well known due to its frequent occurrence on the web."
  },
  {
    "errorcode": "405",
    "errorTitle": "Method Not Allowed",
    "errordesc": "The request method is known by the server but is not supported by the target resource. For example, an API may not allow calling DELETE to remove a resource."
  },
  {
    "errorcode": "406",
    "errorTitle": "Not Acceptable",
    "errordesc": "This response is sent when the web server, after performing server-driven content negotiation, doesn't find any content that conforms to the criteria given by the user agent."
  },
  {
    "errorcode": "407",
    "errorTitle": "Proxy Authentication Required",
    "errordesc": "This is similar to 401 Unauthorized but authentication is needed to be done by a proxy."
  },
  {
    "errorcode": "408",
    "errorTitle": "Request Timeout",
    "errordesc": "This response is sent on an idle connection by some servers, even without any previous request by the client. It means that the server would like to shut down this unused connection. This response is used much more since some browsers, like Chrome, Firefox 27+, or IE9, use HTTP pre-connection mechanisms to speed up surfing. Also note that some servers merely shut down the connection without sending this message."
  },
  {
    "errorcode": "409",
    "errorTitle": "Conflict",
    "errordesc": "This response is sent when a request conflicts with the current state of the server."
  },
  {
    "errorcode": "410",
    "errorTitle": "Gone",
    "errordesc": "This response is sent when the requested content has been permanently deleted from server, with no forwarding address. Clients are expected to remove their caches and links to the resource. The HTTP specification intends this status code to be used for limited-time, promotional services'. APIs should not feel compelled to indicate resources that have been deleted with this status code."
  }
]
